Reports/ЗвонкиЧерезЕКЦПоКлассифайдамИерархия3.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>ЗвонкиЧерезЕКЦПоКлассифайдамИерархия3</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИерархияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИерархияИмя</Name>
					<Comment>Имя иерархии для данного отчета в учетной политике</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Иерархия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сайт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Супергруппа</Name>
							<Comment>Группа верхнего уровняё</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ЗвонкиЧерезЕКЦПоКлассифайдамИерархия3/Forms/Иерархия/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьИерархию();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ЗаписатьИерархию()
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИерархию()
	Об = РеквизитФормыВЗначение("Отчет");
	Об.ЗаписатьИерархию(Параметры.ИмяИерархии);
	ЗначениеВРеквизитФормы(Об, "Отчет");
	
	ЗагрузитьИерархию ();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИерархию ()
	Парам = Новый Структура();
	Парам.Вставить(Параметры.ИмяИерархии);
	РегистрыСведений.УчетнаяПолитика.Получи(Парам);
	
	Если Не ЗначениеЗаполнено(Парам[Параметры.ИмяИерархии]) Тогда
		Возврат
	Иначе
		ПрочитатьИерархию(Парам[Параметры.ИмяИерархии]);
		ЭтаФорма.отчет.ИерархияСтрокой = Парам[Параметры.ИмяИерархии];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьИерархию(Стр)
	ЭтаФорма.Отчет.Иерархия.Очистить();
	
	Чт = Новый ЧтениеXML();
	Чт.УстановитьСтроку(Стр);
	Постр = Новый ПостроительDOM();
	Док = Постр.Прочитать(Чт);
	
	Корень = Док.ДочерниеУзлы[0];
	Для Каждого Ряд Из Корень.ДочерниеУзлы Цикл
			Новая = ЭтаФорма.Отчет.Иерархия.Добавить();
			Новая.Группа 		= Ряд.ДочерниеУзлы[0].ДочерниеУзлы[0].ТекстовоеСодержимое;
			Новая.Сайт 			= Ряд.ДочерниеУзлы[1].ДочерниеУзлы[0].ТекстовоеСодержимое;
			Новая.Супергруппа 	= Ряд.ДочерниеУзлы[2].ДочерниеУзлы[0].ТекстовоеСодержимое;

	КонецЦикла;
	
КонецФункции
